Catalogs/DMS_КоммерческиеАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_КоммерческиеАкции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомбинируемаПолностью</Name>
					<Comment>(акция комбинируема с любыми другими акциями)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецАкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВладельцыСервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автовыбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАкции</Name>
					<Comment>0-все, 1-Кредит, 2-TradeIn, 3-Утилизация</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидкиУчастиеДилера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантСкидки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DMS_ВариантыСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГодыВыпуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДилерскиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДилерскийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_КоммерческиеАкции/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Вызов из форм DMS
	Если Параметры.Свойство("VIN") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТекДата",ТекущаяДата());	
		Список.Параметры.УстановитьЗначениеПараметра("Год",Параметры.Год);
		Список.Параметры.УстановитьЗначениеПараметра("ДилерскийЦентр",Параметры.ДилерскийЦентр);
		
		//Список.Параметры.УстановитьЗначениеПараметра("Кредит",Параметры.Кредит);
		Список.Параметры.УстановитьЗначениеПараметра("TradeIn",Параметры.TradeIn);
		Список.Параметры.УстановитьЗначениеПараметра("Утилизация",Параметры.Утилизация);
		
		Если Параметры.Свойство("ВариантКомплектации") Тогда
			Список.Параметры.УстановитьЗначениеПараметра("БезОтбора",Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",Параметры.ВариантКомплектации);
			Список.Параметры.УстановитьЗначениеПараметра("Модель",Параметры.Модель);
			Список.Параметры.УстановитьЗначениеПараметра("VIN",Параметры.VIN);
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("БезОтбора",Истина);
			Список.Параметры.УстановитьЗначениеПараметра("ВариантКомплектации",NULL);
			Список.Параметры.УстановитьЗначениеПараметра("Модель",NULL);
			Список.Параметры.УстановитьЗначениеПараметра("VIN",NULL);
		КонецЕсли;
	Иначе //Вызов из внешних обработок
		Элементы.Список.Доступность = Ложь;
		Элементы.Список.Видимость = Ложь;
		Элементы.СписокПоУмолчанию.Доступность = Истина;
		Элементы.СписокПоУмолчанию.Видимость = Истина;
		Элементы.кнОК.Доступность = Ложь;
		Элементы.кнОК.Видимость = Ложь;
		Элементы.кнВыбратьПоУмолчанию.Доступность = Истина;
		Элементы.кнВыбратьПоУмолчанию.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока="", Поле="", СтандартнаяОбработка="")
	СтандартнаяОбработка=Ложь;
	Данные=Элементы.Список.ТекущиеДанные;
	//	Закрыть(Новый Структура("КоммерческаяАкция,ВариантСкидки,ЗначениеСкидки",Элементы.Список.ТекущаяСтрока,Данные.ВариантСкидки,Данные.ЗначениеСкидки))
	Если Данные <> Неопределено Тогда
		Закрыть(Новый Структура("КоммерческаяАкция,ВариантСкидки,ЗначениеСкидки,ЗначениеСкидкиУчастиеДилера",Данные.Ссылка,Данные.ВариантСкидки,Данные.ЗначениеСкидки, Данные.ЗначениеСкидкиУчастиеДилера))
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура кнОК2(Команда)
	
	Если ЗначениеЗаполнено(Элементы.СписокПоУмолчанию.ТекущиеДанные) Тогда
		ОповеститьОВыборе(Элементы.СписокПоУмолчанию.ТекущиеДанные.Ссылка)
	Иначе
		ОповеститьОВыборе(Справочники.DMS_КоммерческиеАкции.ПустаяСсылка())
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоУмолчаниюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.СписокПоУмолчанию.ТекущиеДанные.Ссылка)
КонецПроцедуры
